research/visualization_methods/outputs/Bayesian Linear Regression__partially_pooled_with_smoking/partially_pooled_with_smoking.dot
digraph G {
  "FVC_est" [label="FVC_est"];
  "FVC_obs" [label="FVC_obs"];
  "Gamma" [label="Gamma"];
  "KeepLast" [label="KeepLast"];
  "Normal" [label="Normal"];
  "NormalMeanVariance" [label="NormalMeanVariance"];
  "a" [label="a"];
  "b" [label="b"];
  "c" [label="c"];
  "constraints" [label="constraints"];
  "d" [label="d"];
  "data" [label="data"];
  "dataset" [label="dataset"];
  "false" [label="false"];
  "fill" [label="fill"];
  "fillalpha" [label="fillalpha"];
  "i" [label="i"];
  "label" [label="label"];
  "layout" [label="layout"];
  "legend" [label="legend"];
  "length" [label="length"];
  "local p1" [label="local p1"];
  "local p2" [label="local p2"];
  "local p3" [label="local p3"];
  "local p4" [label="local p4"];
  "local p5" [label="local p5"];
  "local p6" [label="local p6"];
  "local α" [label="local α"];
  "local αsmoking" [label="local αsmoking"];
  "local β" [label="local β"];
  "local βsmoking" [label="local βsmoking"];
  "local μ_α" [label="local μ_α"];
  "local μ_β" [label="local μ_β"];
  "map" [label="map"];
  "mean" [label="mean"];
  "n_codes" [label="n_codes"];
  "n_patients" [label="n_patients"];
  "n_smoking_statuses" [label="n_smoking_statuses"];
  "p1" [label="p1"];
  "p2" [label="p2"];
  "p3" [label="p3"];
  "partially_pooled_with_smoking" [label="partially_pooled_with_smoking"];
  "partially_pooled_with_smoking_inference_results" [label="partially_pooled_with_smoking_inference_results"];
  "partially_pooled_with_smooking_constraints" [label="partially_pooled_with_smooking_constraints"];
  "patient_code_encoder" [label="patient_code_encoder"];
  "patient_codes" [label="patient_codes"];
  "patientchart_bayesian" [label="patientchart_bayesian"];
  "plot" [label="plot"];
  "plot(p1, p2, p3, layout" [label="plot(p1, p2, p3, layout"];
  "precision" [label="precision"];
  "q" [label="q"];
  "q(FVC_est, σ)" [label="q(FVC_est, σ)"];
  "q(μ_α_global, σ_α_global, α)" [label="q(μ_α_global, σ_α_global, α)"];
  "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)" [label="q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)"];
  "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)" [label="q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)"];
  "q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)" [label="q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)"];
  "q(μ_β_global, σ_β_global, β)" [label="q(μ_β_global, σ_β_global, β)"];
  "q(σ)" [label="q(σ)"];
  "q(σ_α_global)" [label="q(σ_α_global)"];
  "q(σ_β_global)" [label="q(σ_β_global)"];
  "returnvars" [label="returnvars"];
  "scale" [label="scale"];
  "shape" [label="shape"];
  "size" [label="size"];
  "smoking_status_patient_mapping" [label="smoking_status_patient_mapping"];
  "title" [label="title"];
  "vague" [label="vague"];
  "values" [label="values"];
  "var" [label="var"];
  "weeks" [label="weeks"];
  "α" [label="α"];
  "β" [label="β"];
  "μ(α)" [label="μ(α)"];
  "μ(β)" [label="μ(β)"];
  "μ_α" [label="μ_α"];
  "μ_α_global" [label="μ_α_global"];
  "μ_α_smoking_status" [label="μ_α_smoking_status"];
  "μ_β" [label="μ_β"];
  "μ_β_global" [label="μ_β_global"];
  "μ_β_smoking_status" [label="μ_β_smoking_status"];
  "σ" [label="σ"];
  "σ_α_global" [label="σ_α_global"];
  "σ_β_global" [label="σ_β_global"];
  "FVC_est" -> "data";
  "Gamma" -> "q(σ)";
  "Gamma" -> "q(σ_α_global)";
  "Gamma" -> "q(σ_β_global)";
  "Gamma" -> "σ";
  "Gamma" -> "σ_α_global";
  "Gamma" -> "σ_β_global";
  "KeepLast" -> "returnvars";
  "Normal" -> "data";
  "Normal" -> "local μ_α";
  "Normal" -> "local μ_β";
  "Normal" -> "α";
  "Normal" -> "β";
  "Normal" -> "μ_α_global";
  "Normal" -> "μ_α_smoking_status";
  "Normal" -> "μ_β_global";
  "Normal" -> "μ_β_smoking_status";
  "NormalMeanVariance" -> "μ(α)";
  "NormalMeanVariance" -> "μ(β)";
  "a" -> "plot(p1, p2, p3, layout";
  "b" -> "plot(p1, p2, p3, layout";
  "c" -> "plot(p1, p2, p3, layout";
  "d" -> "local α";
  "d" -> "local αsmoking";
  "d" -> "local β";
  "d" -> "local βsmoking";
  "dataset" -> "FVC_obs";
  "dataset" -> "p1";
  "dataset" -> "p2";
  "dataset" -> "p3";
  "dataset" -> "partially_pooled_with_smoking_inference_results";
  "dataset" -> "patient_codes";
  "dataset" -> "weeks";
  "false" -> "local p1";
  "false" -> "local p2";
  "false" -> "local p3";
  "false" -> "local p4";
  "false" -> "local p5";
  "false" -> "local p6";
  "fill" -> "local p1";
  "fill" -> "local p2";
  "fillalpha" -> "local p1";
  "fillalpha" -> "local p2";
  "i" -> "data";
  "i" -> "α";
  "i" -> "β";
  "label" -> "local p1";
  "label" -> "local p2";
  "layout" -> "plot(p1, p2, p3, layout";
  "legend" -> "local p3";
  "legend" -> "local p4";
  "legend" -> "local p5";
  "legend" -> "local p6";
  "length" -> "n_codes";
  "length" -> "n_patients";
  "length" -> "n_smoking_statuses";
  "map" -> "local α";
  "map" -> "local αsmoking";
  "map" -> "local β";
  "map" -> "local βsmoking";
  "mean" -> "data";
  "mean" -> "α";
  "mean" -> "β";
  "mean" -> "μ_α_global";
  "mean" -> "μ_α_smoking_status";
  "mean" -> "μ_β_global";
  "mean" -> "μ_β_smoking_status";
  "partially_pooled_with_smoking" -> "partially_pooled_with_smoking_inference_results";
  "partially_pooled_with_smoking_inference_results" -> "p1";
  "partially_pooled_with_smoking_inference_results" -> "p2";
  "partially_pooled_with_smoking_inference_results" -> "p3";
  "partially_pooled_with_smooking_constraints" -> "constraints";
  "patient_code_encoder" -> "p1";
  "patient_code_encoder" -> "p2";
  "patient_code_encoder" -> "p3";
  "patient_codes" -> "n_codes";
  "patientchart_bayesian" -> "p1";
  "patientchart_bayesian" -> "p2";
  "patientchart_bayesian" -> "p3";
  "plot" -> "local p1";
  "plot" -> "local p2";
  "plot" -> "local p3";
  "plot" -> "local p4";
  "plot" -> "local p5";
  "plot" -> "local p6";
  "precision" -> "data";
  "precision" -> "α";
  "precision" -> "β";
  "precision" -> "μ_α_smoking_status";
  "precision" -> "μ_β_smoking_status";
  "q" -> "q(FVC_est, σ)";
  "q" -> "q(μ_α_global, σ_α_global, α)";
  "q" -> "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)";
  "q" -> "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)";
  "q" -> "q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)";
  "q" -> "q(μ_β_global, σ_β_global, β)";
  "scale" -> "σ";
  "scale" -> "σ_α_global";
  "scale" -> "σ_β_global";
  "shape" -> "σ";
  "shape" -> "σ_α_global";
  "shape" -> "σ_β_global";
  "size" -> "plot(p1, p2, p3, layout";
  "smoking_status_patient_mapping" -> "partially_pooled_with_smoking_inference_results";
  "smoking_status_patient_mapping" -> "α";
  "smoking_status_patient_mapping" -> "β";
  "title" -> "local p1";
  "title" -> "local p2";
  "title" -> "local p3";
  "title" -> "local p4";
  "title" -> "local p5";
  "title" -> "local p6";
  "vague" -> "μ(α)";
  "vague" -> "μ(β)";
  "values" -> "FVC_obs";
  "values" -> "patient_codes";
  "values" -> "weeks";
  "var" -> "μ_α_global";
  "var" -> "μ_β_global";
  "μ_α" -> "local p1";
  "μ_α_global" -> "q(μ_α_global, σ_α_global, α)";
  "μ_α_global" -> "μ_α_smoking_status";
  "μ_α_smoking_status" -> "α";
  "μ_β" -> "local p2";
  "μ_β_global" -> "q(μ_β_global, σ_β_global, β)";
  "μ_β_global" -> "μ_β_smoking_status";
  "μ_β_smoking_status" -> "β";
  "σ" -> "data";
  "σ_α_global" -> "α";
  "σ_α_global" -> "μ_α_smoking_status";
  "σ_β_global" -> "β";
  "σ_β_global" -> "μ_β_smoking_status";
}
