research/visualization_methods/outputs/Bayesian Linear Regression__partially_pooled_with_smoking/partially_pooled_with_smoking.mmd
graph TD
  FVC_est["FVC_est"]
  FVC_obs["FVC_obs"]
  Gamma["Gamma"]
  KeepLast["KeepLast"]
  Normal["Normal"]
  NormalMeanVariance["NormalMeanVariance"]
  a["a"]
  b["b"]
  c["c"]
  constraints["constraints"]
  d["d"]
  data["data"]
  dataset["dataset"]
  false["false"]
  fill["fill"]
  fillalpha["fillalpha"]
  i["i"]
  label["label"]
  layout["layout"]
  legend["legend"]
  length["length"]
  local p1["local p1"]
  local p2["local p2"]
  local p3["local p3"]
  local p4["local p4"]
  local p5["local p5"]
  local p6["local p6"]
  local α["local α"]
  local αsmoking["local αsmoking"]
  local β["local β"]
  local βsmoking["local βsmoking"]
  local μ_α["local μ_α"]
  local μ_β["local μ_β"]
  map["map"]
  mean["mean"]
  n_codes["n_codes"]
  n_patients["n_patients"]
  n_smoking_statuses["n_smoking_statuses"]
  p1["p1"]
  p2["p2"]
  p3["p3"]
  partially_pooled_with_smoking["partially_pooled_with_smoking"]
  partially_pooled_with_smoking_inference_results["partially_pooled_with_smoking_inference_results"]
  partially_pooled_with_smooking_constraints["partially_pooled_with_smooking_constraints"]
  patient_code_encoder["patient_code_encoder"]
  patient_codes["patient_codes"]
  patientchart_bayesian["patientchart_bayesian"]
  plot["plot"]
  plot(p1, p2, p3, layout["plot(p1, p2, p3, layout"]
  precision["precision"]
  q["q"]
  q(FVC_est, σ)["q(FVC_est, σ)"]
  q(μ_α_global, σ_α_global, α)["q(μ_α_global, σ_α_global, α)"]
  q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)["q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)"]
  q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)["q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)"]
  q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)["q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)"]
  q(μ_β_global, σ_β_global, β)["q(μ_β_global, σ_β_global, β)"]
  q(σ)["q(σ)"]
  q(σ_α_global)["q(σ_α_global)"]
  q(σ_β_global)["q(σ_β_global)"]
  returnvars["returnvars"]
  scale["scale"]
  shape["shape"]
  size["size"]
  smoking_status_patient_mapping["smoking_status_patient_mapping"]
  title["title"]
  vague["vague"]
  values["values"]
  var["var"]
  weeks["weeks"]
  α["α"]
  β["β"]
  μ(α)["μ(α)"]
  μ(β)["μ(β)"]
  μ_α["μ_α"]
  μ_α_global["μ_α_global"]
  μ_α_smoking_status["μ_α_smoking_status"]
  μ_β["μ_β"]
  μ_β_global["μ_β_global"]
  μ_β_smoking_status["μ_β_smoking_status"]
  σ["σ"]
  σ_α_global["σ_α_global"]
  σ_β_global["σ_β_global"]
  FVC_est --> data
  Gamma --> q(σ)
  Gamma --> q(σ_α_global)
  Gamma --> q(σ_β_global)
  Gamma --> σ
  Gamma --> σ_α_global
  Gamma --> σ_β_global
  KeepLast --> returnvars
  Normal --> data
  Normal --> local μ_α
  Normal --> local μ_β
  Normal --> α
  Normal --> β
  Normal --> μ_α_global
  Normal --> μ_α_smoking_status
  Normal --> μ_β_global
  Normal --> μ_β_smoking_status
  NormalMeanVariance --> μ(α)
  NormalMeanVariance --> μ(β)
  a --> plot(p1, p2, p3, layout
  b --> plot(p1, p2, p3, layout
  c --> plot(p1, p2, p3, layout
  d --> local α
  d --> local αsmoking
  d --> local β
  d --> local βsmoking
  dataset --> FVC_obs
  dataset --> p1
  dataset --> p2
  dataset --> p3
  dataset --> partially_pooled_with_smoking_inference_results
  dataset --> patient_codes
  dataset --> weeks
  false --> local p1
  false --> local p2
  false --> local p3
  false --> local p4
  false --> local p5
  false --> local p6
  fill --> local p1
  fill --> local p2
  fillalpha --> local p1
  fillalpha --> local p2
  i --> data
  i --> α
  i --> β
  label --> local p1
  label --> local p2
  layout --> plot(p1, p2, p3, layout
  legend --> local p3
  legend --> local p4
  legend --> local p5
  legend --> local p6
  length --> n_codes
  length --> n_patients
  length --> n_smoking_statuses
  map --> local α
  map --> local αsmoking
  map --> local β
  map --> local βsmoking
  mean --> data
  mean --> α
  mean --> β
  mean --> μ_α_global
  mean --> μ_α_smoking_status
  mean --> μ_β_global
  mean --> μ_β_smoking_status
  partially_pooled_with_smoking --> partially_pooled_with_smoking_inference_results
  partially_pooled_with_smoking_inference_results --> p1
  partially_pooled_with_smoking_inference_results --> p2
  partially_pooled_with_smoking_inference_results --> p3
  partially_pooled_with_smooking_constraints --> constraints
  patient_code_encoder --> p1
  patient_code_encoder --> p2
  patient_code_encoder --> p3
  patient_codes --> n_codes
  patientchart_bayesian --> p1
  patientchart_bayesian --> p2
  patientchart_bayesian --> p3
  plot --> local p1
  plot --> local p2
  plot --> local p3
  plot --> local p4
  plot --> local p5
  plot --> local p6
  precision --> data
  precision --> α
  precision --> β
  precision --> μ_α_smoking_status
  precision --> μ_β_smoking_status
  q --> q(FVC_est, σ)
  q --> q(μ_α_global, σ_α_global, α)
  q --> q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)
  q --> q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)
  q --> q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)
  q --> q(μ_β_global, σ_β_global, β)
  scale --> σ
  scale --> σ_α_global
  scale --> σ_β_global
  shape --> σ
  shape --> σ_α_global
  shape --> σ_β_global
  size --> plot(p1, p2, p3, layout
  smoking_status_patient_mapping --> partially_pooled_with_smoking_inference_results
  smoking_status_patient_mapping --> α
  smoking_status_patient_mapping --> β
  title --> local p1
  title --> local p2
  title --> local p3
  title --> local p4
  title --> local p5
  title --> local p6
  vague --> μ(α)
  vague --> μ(β)
  values --> FVC_obs
  values --> patient_codes
  values --> weeks
  var --> μ_α_global
  var --> μ_β_global
  μ_α --> local p1
  μ_α_global --> q(μ_α_global, σ_α_global, α)
  μ_α_global --> μ_α_smoking_status
  μ_α_smoking_status --> α
  μ_β --> local p2
  μ_β_global --> q(μ_β_global, σ_β_global, β)
  μ_β_global --> μ_β_smoking_status
  μ_β_smoking_status --> β
  σ --> data
  σ_α_global --> α
  σ_α_global --> μ_α_smoking_status
  σ_β_global --> β
  σ_β_global --> μ_β_smoking_status
